import React from 'react'
import Airticle from './Airticle'
import { title } from 'process'
import Image from 'next/image'
import Reactions from '../Reactions'
import File from '../icons/File'
import CommentList from '../CommentList'

const AirticleList = () => {
    return (
        <>
            <div className='flex mt-36'>
                <div className='w-8/12 flex flex-col gap-20'>
                    {
                        [
                            {
                                title: "Како до најдобар избор при процесот на регрутација",
                                body: "Процесот на регрутација е клучен за успехот на секоја организација. Селекцијата на вистинските кандидати може значително да влијае на продуктивноста, културата и развојот на компанијата. Следните чекори и совети ќе ви помогнат да направите најдобар избор при регрутацијата."
                            },
                            {
                                title: "Прецизно дефинирање на позицијата",
                                body: "Првиот чекор кон успешна регрутација е јасно дефинирање на позицијата. Ова вклучува детално опишување на задачите, одговорностите и потребните квалификации. Кога огласот за работа е прецизен, ќе привлечете кандидати кои се вистински заинтересирани и квалификувани за позицијата.",
                                note: "Користете конкретни и мерливи критериуми при опишувањето на задачите и квалификациите за позицијата."
                            },
                            {
                                title: "Развивање на ефикасна стратегија за привлекување кандидати",
                                body: "Откако ќе го дефинирате профилот на идеалниот кандидат, потребно е да развиете стратегија за привлекување на такви кандидати. Ова може да вклучува користење на различни канали за регрутација, како што се огласни табли, социјални медиуми и професионални мрежи.",
                                note: "Користете различни платформи за регрутација за да допрете до поширока и разновидна база на кандидати."
                            },
                            {
                                title: "Спроведување на структуриран процес на интервју",
                                body: "Структурираниот процес на интервју е од суштинско значење за објективна и фер селекција. Ова вклучува подготовка на прашања кои се релевантни за позицијата и кои ќе ви помогнат да ја процените способноста на кандидатите да ги исполнат барањата на работата.",
                                note: "Секогаш користете ист сет на прашања за сите кандидати за да осигурате фер и доследен процес."
                            },
                            {
                                title: "Вклучување на релевантни тестови и проценки",
                                body: "Тестовите и проценките можат да бидат од голема помош при проценката на вештините и компетенциите на кандидатите. Ова може да вклучува тестови за технички вештини, психометриски тестови или проценки на личноста.",
                                note: "Одберете тестови кои се директно поврзани со клучните вештини потребни за позицијата."
                            },
                            {
                                title: "Донесување на информирана одлука",
                                body: "Последниот чекор е донесувањето на информирана одлука. Ова подразбира анализа на сите информации собрани за време на процесот на регрутација, вклучувајќи го интервјуто, резултатите од тестовите и препораките.",
                                note: "Вклучете повеќе членови од тимот во процесот на донесување одлука за да добиете различни перспективи и да осигурате пообјективен избор."
                            },
                            {
                                title: "Заклучок",
                                body: "Регрутацијата е комплексен процес кој бара внимателно планирање и имплементација. Преку прецизно дефинирање на позицијата, развивање на ефикасна стратегија за привлекување кандидати, спроведување на структуриран процес на интервју, вклучување на релевантни тестови и проценки и донесување на информирана одлука, можете да осигурате дека ќе го направите најдобриот избор за вашата организација."
                            }
                        ].map(({ title, body, note }) => (<div key={title}><Airticle title={title} body={body} note={note} /></div>))
                    }
                    <div className='mt-10'>
                        <Reactions like={335} love={45} comment={34} />
                    </div>
                    <div>
                        <div style={{ border: "2px solid orange", height: "338px" }} className='rounded-md flex flex-col justify-between py-5'>
                            <div className='flex gap-5 pt-3 px-5'>
                                <Image src='/commentavator.png' alt='coment image' width={69} height={65} />
                                <h2 className='text-primary'>Според мене тестовите и проценките можат да бидат од голема помош при проценката на вештините и компетенциите на кандидатите... </h2>
                            </div>
                            <div className='flex justify-between px-5'>
                                <File />
                                <button className='text-white bg-orange-400 px-6 py-3 rounded-full'>Коментирај</button>
                            </div>
                        </div>
                    </div>
                    <div>
                        <CommentList/>
                    </div>
                </div>
                <div className='4/12 pl-32'>
                    <div>
                        <Image src='/articleside.png' alt='article side' width={376} height={376} />
                    </div>
                    <p className='font-bold my-8'>Ѓоко Вукановски</p>
                    <div>
                        <Image src='/articleframe.png' width={376} height={99} alt='t' />
                    </div>
                    <div className='flex flex-col gap-5 mt-14'>
                        {
                            ['Кратка содржина', 'Прецизно дефинирање на позицијата', 'Развивање на ефикасна стратегија за привлекување кандидати', 'Спроведување на структуриран процес на интервју', 'Вклучување на релевантни тестови и проценки', 'Донесување на информирана одлука', 'Заклучок', 'Коментари'].map(d => <h1 className='hover:text-orange-400 hover:border-l-orange-400' key={d}>{d}</h1>)
                        }
                    </div>
                </div>
            </div>
        </>
    )
}

export default AirticleList
