import Hero from "@/components/Hero";
import Sliders from "@/components/Sliders";
import Image from "next/image";

export default function Page() {
    return (
        <div>
            <div className="container">
                <Hero leftImage="heroleft.png" rightImage="blogright.png" />
            </div>
            <div>
                <Sliders />
            </div>
            <div className="container">
                <div className="flex gap-3">
                    <p>Почетна</p>
                    <p>{">"}</p>
                    <p className="text-[orange]">Годишна конференција</p>
                </div>
                <div className="mt-32 flex gap-20">
                    <div style={{ width: "465px", height: "577px" }}>
                        <Image src='/about1.png' alt="about" width={465} height={577} />
                    </div>
                    <div className="w-8/12 mt-20">
                        <h1 className="text-5xl font-semibold mb-16">МИСИЈА И ВИЗИЈА</h1>
                        <h3 className="text-3xl w-6/12 mb-12">Македонска Асоцијација за Човечки Ресурси</h3>
                        <p className="mb-10">МАЧР е стручно, невладино, непартиско и непрофитно здружение на граѓани формирано на 22 април 2009 година, заради вршење на дејности и активности поврзани со развојот на работната сила, промоција на управувањето со човечките ресурси, како и унапредување на професијата управување со човечки ресурси.</p>
                        <p>
                            <span className="text-orange-400">Мисија:</span> “Мисија на МАЧР е унапредување и развој на професијата менаџмент со човечките ресурси”.
                        </p>
                        <p>
                            <span className="text-orange-400">Визија:</span> “Визија на МАЧР е развој на луѓето и организациите!”
                        </p>
                    </div>
                </div>
                <div className="flex mt-16 gap-10">
                    <div className="w-8/12">
                        <h1 className="text-5xl text-primary mb-[56px]">Цели и задачи:</h1>
                        <p className="text-body mb-2"><span className="text-orange-400">ПОДДРШКА</span> на највисоките идеали во областа на управувањето со човечки ресурси и посестрано прифаќање и ценење на професијата;</p>
                        <p className="text-body mb-2"><span className="text-orange-400">ПРИЗНАВАЊЕ</span> на управувањето со човечки ресурси поради неговиот придонес за успешно работење и зајакнување на способноста и кредибилитетот на професијата управување со човечки ресурси;</p>
                        <p className="text-body mb-2"><span className="text-orange-400">СТРЕМЕЖ</span> да бидеме водачи во развојот и промовирањето на добрите практики во професијата управување со човечки ресурси, што ќе ги применуваат и професионалните членови и нивните колеги и да ги поставиме основните национални стандарди за управување со човечки ресурси; Лобирање кај владата и поднесување на документи во име на членовите и трети лица.</p>

                    </div>
                    <div>
                        <Image src='/about2.png' alt="about second" width={456} height={483} />
                    </div>
                </div>
                <div className="flex gap-10">
                    <div>
                        <Image src='/person3.png' alt="person three" width={376} height={376} />
                    </div>
                    <div className="w-8/12">
                        <h1 className="text-4xl mb-3">
                            Претседател на МАЧР
                        </h1>
                        <h4 className="text-orange-400 text-xl mb-10">
                            м-р Дарко Петровски
                        </h4>
                        <p className="text-sm text-body mb-7">
                            Дарко е еден од основачите на МАЧР, каде придонесуваше како член на УО, претседател на Надзорниот одбор, генерален секретар и уредник на електронскиот весник на МАЧР, а на последното Собрание во декември 2018 беше избран за Претседател на Македонската асоцијација за човечки ресурси. Дарко помина речиси 9 годишен работен ангажман како раководител на одделот за човечки ресурси и организација во ЕВН, еден од најголемите работодавачи во Македонија. Пред тоа, тој беше на чело на Канцеларијата за економски прашања при Австриската амбасада во Скопје.
                        </p>
                        <p className="text-sm text-body mb-7">
                            Дарко е основач на Талент бизнис инкубаторот Степ-ап кој нуди програми за стипендирање и развој на таленти, за практикантска работа и консултантски услуги во областа на стратегиски деловен развој, организациски развој и менаџмент со човечките ресурси. Тој е и ко-основач и партнер во Динамик Консалтинг и е вклучен во проекти како менаџмент консултант во различни области.
                        </p>
                        <p className="text-sm text-body mb-7">
                            Покрај професионалниот ангажман, Дарко бил и е сеуште активен во повеќе организации како Организацијата на работодавачи на Македонија, Националниот економско-социјален совет, Локалниот економско-социјален совет на град Скопје, Техничкиот комитет за менаџмент со човечките ресурси (ТК42) при Институтот за стандардизација на РМ, Националниот совет за претприемништво и конкурентност, советодавните одбори на Универзитетот за туризам и менаџмент во Скопје и на Универзитетот Американ Колеџ Скопје.
                        </p>
                        <p className="text-sm text-body mb-7">
                            Дарко магистрираше економски науки на Економскиот факултет во Љубљана и е магистер по бизнис администрација и организациски науки, со специјализација во менаџментот со човечките ресурси, а исто така е дипломиран машински инженер и автор на повеќе стручни и научно-истражувачки трудови.
                        </p>
                    </div>
                </div>
            </div>
        </div>
    )
}