import React from 'react'
import Reactions from './Reactions'
import UserCard from './UserCard'

const CommentItem = () => {
    return (
        <div>
            <UserCard />
            <p className='my-10'>
                Регрутацијата е комплексен процес кој бара внимателно планирање и имплементација. Преку прецизно дефинирање на позицијата, развивање на ефикасна стратегија за привлекување кандидати, спроведување на структуриран процес на интервју, вклучување на релевантни тестови и проценки и донесување на информирана одлука, можете да осигурате дека ќе го направите најдобриот избор за вашата организација.
            </p>
            <Reactions like={10} comment={3} />
            <div className='ml-20 my-10'>
                <div>
                    <UserCard />
                    <p className='my-6'>
                        Регрутацијата е комплексен процес кој бара внимателно планирање и имплементација. Преку прецизно дефинирање на позицијата, развивање на ефикасна стратегија за привлекување кандидати, спроведување на структуриран процес на интервју, вклучување на релевантни тестови и проценки и донесување на информирана одлука, можете да осигурате дека ќе го направите најдобриот избор за вашата организација.
                    </p>
                </div>
                <div>
                    <UserCard />
                    <p className='my-6'>
                        Регрутацијата е комплексен процес кој бара внимателно планирање и имплементација. Преку прецизно дефинирање на позицијата, развивање на ефикасна стратегија за привлекување кандидати, спроведување на структуриран процес на интервју, вклучување на релевантни тестови и проценки и донесување на информирана одлука, можете да осигурате дека ќе го направите најдобриот избор за вашата организација.
                    </p>
                </div>
                <div>
                    <UserCard />
                    <p className='my-6'>
                        Регрутацијата е комплексен процес кој бара внимателно планирање и имплементација. Преку прецизно дефинирање на позицијата, развивање на ефикасна стратегија за привлекување кандидати, спроведување на структуриран процес на интервју, вклучување на релевантни тестови и проценки и донесување на информирана одлука, можете да осигурате дека ќе го направите најдобриот избор за вашата организација.
                    </p>
                </div>
                <div>
                    <UserCard />
                    <p className='my-6'>
                        Регрутацијата е комплексен процес кој бара внимателно планирање и имплементација. Преку прецизно дефинирање на позицијата, развивање на ефикасна стратегија за привлекување кандидати, спроведување на структуриран процес на интервју, вклучување на релевантни тестови и проценки и донесување на информирана одлука, можете да осигурате дека ќе го направите најдобриот избор за вашата организација.
                    </p>
                </div>
            </div>
            <UserCard />
            <p className='my-10'>
                Регрутацијата е комплексен процес кој бара внимателно планирање и имплементација. Преку прецизно дефинирање на позицијата, развивање на ефикасна стратегија за привлекување кандидати, спроведување на структуриран процес на интервју, вклучување на релевантни тестови и проценки и донесување на информирана одлука, можете да осигурате дека ќе го направите најдобриот избор за вашата организација.
            </p>
            <Reactions like={10} comment={3} />
        </div>
    )
}

export default CommentItem
